Revit 2027 API
ViewNavigationToolSettings.IsHomeCameraSet Method
 Checks if the home view is set in the settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsHomeCameraSet()
Public Function IsHomeCameraSet As Boolean
public:
bool IsHomeCameraSet()
member IsHomeCameraSet : unit -> bool
Return Value
Boolean
 Returns true if home view is set, otherwise false.
See Also
Reference
ViewNavigationToolSettings Class
Autodesk.Revit.DB Namespace